acl
acpi
acpid
adobe-source-code-pro-fonts
adwaita-icon-theme
alsa-card-profiles
alsa-lib
alsa-topology-conf
alsa-ucm-conf
alsa-utils
android-udev
aom
arandr
archlinux-keyring
argon2
asciidoc
at-spi2-atk
at-spi2-core
atk
atkmm
attr
audiofile
audit
autoconf
automake
avahi
axel
base
bash
bc
bind
binutils
bison
blueman
bluez
bluez-libs
bluez-tools
bluez-utils
boost
boost-libs
box2d
bridge-utils
brotli
btrfs-progs
bubblewrap
bzip2
c-ares
ca-certificates
ca-certificates-mozilla
ca-certificates-utils
cairo
cairomm
calc
calcurse
cantarell-fonts
ccid
cdparanoia
chromaprint
chrony
cifs-utils
clucene
cmake
code
colord
colord-sane
containerd
coreutils
cpio
cronie
cryptsetup
cups
cups-filters
curl
dash
dav1d
db
dbus
dbus-glib
dconf
desktop-file-utils
device-mapper
dhcpcd
diffutils
discord
djvulibre
dkms
dmenu
dmraid
dnssec-anchors
docbook-xml
docbook-xsl
docker
docker-compose
dosfstools
double-conversion
dracut
duktape
dunst
e2fsprogs
easytag
efibootmgr
efivar
egl-wayland
eglexternalplatform
electron13
electron18
emacs
ethtool
exempi
exiv2
expat
f2fs-tools
faad2
fakeroot
feh
ffmpeg
fftw
file
filesystem
findutils
firefox
flac
flex
fluidsynth
fmt
fontconfig
foomatic-db
foomatic-db-engine
fprintd
freetype2
fribidi
fuse-common
fuse2
fuse3
fzf
gawk
gc
gcc
gcc-libs
gcr
gd
gdbm
gdk-pixbuf2
geoip
geoip-database
gettext
ghc-libs
ghostscript
giflib
girara
git
glew
glib-networking
glib2
glibc
glibmm
glslang
glu
gmime3
gmp
gnome-autoar
gnome-desktop
gnome-desktop-common
gnu-free-fonts
gnupg
gnutls
go
gobject-introspection-runtime
gpgme
gpm
gptfdisk
gradle
graphene
graphite
grep
groff
grub
gsasl
gsettings-desktop-schemas
gsfonts
gsm
gst-plugins-base
gst-plugins-base-libs
gstreamer
gtk-update-icon-cache
gtk2
gtk3
gtkd
gtkmm
gtkmm3
guile
gumbo-parser
gupnp-dlna
gvfs
gzip
harfbuzz
harfbuzz-icu
haskell-aeson
haskell-aeson-pretty
haskell-ansi-terminal
haskell-appar
haskell-asn1-encoding
haskell-asn1-parse
haskell-asn1-types
haskell-assoc
haskell-async
haskell-attoparsec
haskell-base-compat
haskell-base-compat-batteries
haskell-base-orphans
haskell-base16-bytestring
haskell-base64-bytestring
haskell-basement
haskell-bifunctors
haskell-blaze-builder
haskell-blaze-html
haskell-blaze-markup
haskell-byteable
haskell-byteorder
haskell-case-insensitive
haskell-cereal
haskell-citeproc
haskell-cmdargs
haskell-colour
haskell-commonmark
haskell-commonmark-extensions
haskell-commonmark-pandoc
haskell-comonad
haskell-conduit
haskell-conduit-extra
haskell-connection
haskell-cookie
haskell-cryptonite
haskell-data-default
haskell-data-default-class
haskell-data-default-instances-containers
haskell-data-default-instances-dlist
haskell-data-default-instances-old-locale
haskell-data-fix
haskell-digest
haskell-distributive
haskell-dlist
haskell-doclayout
haskell-doctemplates
haskell-emojis
haskell-erf
haskell-file-embed
haskell-ghc-bignum-orphans
haskell-glob
haskell-haddock-library
haskell-hashable
haskell-hourglass
haskell-hslua
haskell-hslua-aeson
haskell-hslua-classes
haskell-hslua-core
haskell-hslua-marshalling
haskell-hslua-module-doclayout
haskell-hslua-module-path
haskell-hslua-module-system
haskell-hslua-module-text
haskell-hslua-module-version
haskell-hslua-objectorientation
haskell-hslua-packaging
haskell-hsyaml
haskell-http-client
haskell-http-client-tls
haskell-http-types
haskell-indexed-traversable
haskell-integer-logarithms
haskell-iproute
haskell-ipynb
haskell-jira-wiki-markup
haskell-juicypixels
haskell-lexer
haskell-libyaml
haskell-lpeg
haskell-lua
haskell-memory
haskell-mime-types
haskell-mono-traversable
haskell-network
haskell-network-uri
haskell-old-locale
haskell-old-time
haskell-pandoc-lua-marshal
haskell-pandoc-types
haskell-pem
haskell-pretty-show
haskell-primitive
haskell-quickcheck
haskell-random
haskell-resourcet
haskell-safe
haskell-scientific
haskell-sha
haskell-skylighting
haskell-skylighting-core
haskell-socks
haskell-split
haskell-splitmix
haskell-streaming-commons
haskell-strict
haskell-syb
haskell-tagged
haskell-tagsoup
haskell-temporary
haskell-texmath
haskell-text-conversions
haskell-text-icu
haskell-th-abstraction
haskell-th-compat
haskell-th-lift
haskell-th-lift-instances
haskell-these
haskell-time-compat
haskell-tls
haskell-transformers-compat
haskell-typed-process
haskell-unicode-collation
haskell-unicode-data
haskell-unicode-transforms
haskell-uniplate
haskell-unliftio-core
haskell-unordered-containers
haskell-utf8-string
haskell-uuid-types
haskell-vector
haskell-vector-algorithms
haskell-x509
haskell-x509-store
haskell-x509-system
haskell-x509-validation
haskell-xml
haskell-xml-conduit
haskell-xml-types
haskell-yaml
haskell-zip-archive
haskell-zlib
hdparm
hicolor-icon-theme
hidapi
htop
hunspell
hwdata
hwloc
hyphen
iana-etc
icu
id3lib
ijs
imagemagick
imlib2
iniparser
intel-gpu-tools
intel-ucode
iproute2
iptables
iputils
iso-codes
isync
iw
jack2
jansson
java-commons-logging
java-environment-common
java-runtime-common
jbig2dec
jdk17-openjdk
jemalloc
jq
jre17-openjdk
jre17-openjdk-headless
json-c
json-glib
jsoncpp
kbd
kconfig
kcoreaddons
kdesu
keyutils
ki18n
kmod
kpty
krb5
kyotocabinet
l-smash
lame
lcms2
ldb
ldns
less
libabw
libaio
libao
libarchive
libass
libassuan
libasyncns
libatasmart
libatomic_ops
libavc1394
libavif
libblockdev
libbluray
libbpf
libbs2b
libbsd
libbytesize
libcanberra
libcap
libcap-ng
libcddb
libcdio
libcdio-paranoia
libcdr
libclc
libcloudproviders
libcolord
libconfig
libcue
libcups
libdaemon
libdatrie
libdbusmenu-glib
libdbusmenu-gtk3
libde265
libdecor
libdiscid
libdrm
libdvdnav
libdvdread
libe-book
libedit
libelf
libepoxy
libepubgen
libetonyek
libev
libevdev
libevent
libexif
libexttextcat
libfdk-aac
libffi
libfontenc
libfprint
libfreeaptx
libfreehand
libgcrypt
libgexiv2
libglvnd
libgme
libgpg-error
libgphoto2
libgrss
libgsf
libgudev
libgusb
libgxps
libhandy
libheif
libical
libice
libid3tag
libidn
libidn2
libiec61883
libieee1284
libimagequant
libimobiledevice
libinih
libinput
libinstpatch
libiptcdata
libisl
libixion
libjpeg-turbo
libksba
liblangtag
libldac
libldap
liblouis
liblphobos
liblqr
libluv
libmad
libmaxminddb
libmbim
libmd
libmfx
libmicrohttpd
libmikmod
libmm-glib
libmms
libmnl
libmodplug
libmpc
libmpcdec
libmpdclient
libmspub
libmtp
libmwaw
libmythes
libnautilus-extension
libndp
libnet
libnetfilter_conntrack
libnewt
libnfnetlink
libnfs
libnftnl
libnghttp2
libnl
libnm
libnotify
libnsl
libnumbertext
libodfgen
libogg
libomxil-bellagio
libopenmpt
liborcus
libosinfo
libotf
libp11-kit
libpagemaker
libpaper
libpcap
libpciaccess
libpgm
libpipeline
libplacebo
libplist
libpng
libportal
libportal-gtk3
libproxy
libpsl
libpulse
libqmi
libqrtr-glib
libqxp
libraqm
libraw1394
libreoffice-fresh
librevenge
librsvg
libsamplerate
libsasl
libsass
libseccomp
libsecret
libshout
libsidplayfp
libsigc++
libsignal-protocol-c
libsixel
libsm
libsndfile
libsodium
libsoup
libsoup3
libsoxr
libspectre
libssh
libssh2
libstaroffice
libstemmer
libsynctex
libsysprof-capture
libtasn1
libteam
libtermkey
libthai
libtheora
libtiff
libtirpc
libtommath
libtool
libunistring
libunwind
libupnp
liburcu
liburing
libusb
libusbmuxd
libutempter
libuv
libva
libva-intel-driver
libva-utils
libvdpau
libverto
libvisio
libvisual
libvorbis
libvpx
libvterm
libvterm01
libwacom
libwebp
libwmf
libwpd
libwpg
libwps
libx11
libxau
libxaw
libxcb
libxcomposite
libxcrypt
libxcursor
libxcvt
libxdamage
libxdg-basedir
libxdmcp
libxext
libxfixes
libxfont2
libxi
libxinerama
libxkbcommon
libxkbcommon-x11
libxkbfile
libxml2
libxmu
libxpm
libxrandr
libxrender
libxshmfence
libxslt
libxss
libxt
libxtst
libxv
libxvmc
libxxf86vm
libyaml
libyuv
libzmf
licenses
lilv
links
linux
linux-api-headers
linux-firmware
linux-firmware-whence
linux-headers
llvm-libs
lm_sensors
lmdb
lpsolve
lua
lua-lpeg
lua53
luajit
lv2
lvm2
lxappearance
lynx
lz4
lzo
m17n-db
m17n-lib
m4
mailcap
maim
make
man-db
man-pages
mariadb-libs
mcpp
md4c
mdadm
mesa
mesa-vdpau
minizip
mkinitcpio
mkinitcpio-busybox
mobile-broadband-provider-info
modemmanager
mpc
mpd
mpfr
mpg123
mpv
msgpack-c
msmtp
mtdev
mujs
mupdf
nano
nautilus
ncmpcpp
ncurses
ndctl
neofetch
neomutt
neon
neovim
net-snmp
nettle
networkmanager
newsboat
nginx
nitrogen
nmap
node-gyp
nodejs
nodejs-nopt
notmuch
notmuch-runtime
noto-fonts-cjk
noto-fonts-emoji
npm
npth
nspr
nss
numactl
oath-toolkit
ocl-icd
oniguruma
openal
opencore-amr
openjpeg2
openldap
openmpi
openpmix
openresolv
openssh
openssl
opus
opusfile
orc
os-prober
osinfo-db
p11-kit
p7zip
pacman
pacman-mirrorlist
pahole
pam
pambase
pamixer
pandoc
pango
pangomm
parted
pass
pass-otp
patch
pavucontrol
pciutils
pcre
pcre2
pcsclite
peg
perl
perl-alien-build
perl-alien-libxml2
perl-capture-tiny
perl-clone
perl-dbi
perl-error
perl-ffi-checklib
perl-file-chdir
perl-file-which
perl-mailtools
perl-path-tiny
perl-timedate
perl-xml-libxml
perl-xml-namespacesupport
perl-xml-sax
perl-xml-sax-base
picard
picom
pinentry
pipewire
pixman
pkgconf
polkit
polybar
poppler
poppler-data
poppler-glib
popt
portaudio
powertop
ppp
procps-ng
progress
protobuf
psmisc
pulseaudio
pulsemixer
pwgen
python
python-appdirs
python-attrs
python-cairo
python-certifi
python-cffi
python-click
python-cryptography
python-dateutil
python-discid
python-docopt
python-fasteners
python-fido2
python-gobject
python-importlib-metadata
python-jaraco.context
python-jaraco.functools
python-jaraco.text
python-jinja
python-markdown
python-markupsafe
python-more-itertools
python-mutagen
python-nspektr
python-ordered-set
python-packaging
python-pillow
python-ply
python-pyalsa
python-pycparser
python-pyjwt
python-pyopenssl
python-pyparsing
python-pyqt5
python-pyqt5-sip
python-pyqt5-webengine
python-pyscard
python-setuptools
python-six
python-tomli
python-trove-classifiers
python-urwid
python-validate-pyproject
python-xlib
python-yaml
python-zipp
qpdf
qrencode
qt5-base
qt5-declarative
qt5-location
qt5-multimedia
qt5-serialport
qt5-svg
qt5-translations
qt5-webchannel
qt5-webengine
qutebrowser
ranger
raptor
rasqal
rav1e
re2
readline
redland
refind
rest
rhash
ripgrep
rocksdb
rofi
rtkit
rubberband
run-parts
runc
rustup
sane
sassc
sbc
sdl2
sed
semver
serd
shaderc
shadow
shared-mime-info
simple-scan
slang
slop
smbclient
snappy
sord
sound-theme-freedesktop
speedtest-cli
speex
speexdsp
spirv-tools
sqlite
sratom
srt
startup-notification
stfl
sudo
svt-av1
sysfsutils
systemd
systemd-libs
systemd-sysvcompat
taglib
talloc
tar
tbb
tdb
terminus-font
tevent
texinfo
thin-provisioning-tools
tlp
tmux
totem-pl-parser
tpm2-tss
traceroute
tracker3
tracker3-miners
tree
tree-sitter
tslib
ttf-inconsolata
ttf-linux-libertine
twolame
tzdata
uchardet
udisks2
ueberzug
unibilium
unixodbc
unzip
upower
usbmuxd
usbutils
util-linux
util-linux-libs
v4l-utils
vid.stab
vim
vim-runtime
vmaf
volume_key
vulkan-icd-loader
w3m
wavpack
wayland
wayland-protocols
webrtc-audio-processing
wget
which
wildmidi
wireless_tools
wpa_supplicant
x264
x265
xapian-core
xcb-proto
xcb-util
xcb-util-cursor
xcb-util-image
xcb-util-keysyms
xcb-util-renderutil
xcb-util-wm
xcb-util-xrm
xclip
xdg-utils
xdo
xdotool
xf86-input-evdev
xf86-input-libinput
xf86-input-synaptics
xf86-input-vmmouse
xf86-input-wacom
xf86-video-amdgpu
xf86-video-ati
xf86-video-dummy
xf86-video-fbdev
xf86-video-intel
xf86-video-nouveau
xf86-video-vesa
xf86-video-vmware
xfsprogs
xkeyboard-config
xmlsec
xorg-bdftopcf
xorg-docs
xorg-font-util
xorg-fonts-100dpi
xorg-fonts-75dpi
xorg-fonts-alias-100dpi
xorg-fonts-alias-75dpi
xorg-fonts-encodings
xorg-iceauth
xorg-mkfontscale
xorg-server
xorg-server-common
xorg-server-devel
xorg-server-xephyr
xorg-server-xnest
xorg-server-xvfb
xorg-sessreg
xorg-setxkbmap
xorg-smproxy
xorg-util-macros
xorg-x11perf
xorg-xauth
xorg-xbacklight
xorg-xcmsdb
xorg-xcursorgen
xorg-xdpyinfo
xorg-xdriinfo
xorg-xev
xorg-xgamma
xorg-xhost
xorg-xinit
xorg-xinput
xorg-xkbcomp
xorg-xkbevd
xorg-xkbutils
xorg-xkill
xorg-xlsatoms
xorg-xlsclients
xorg-xmodmap
xorg-xpr
xorg-xprop
xorg-xrandr
xorg-xrdb
xorg-xrefresh
xorg-xset
xorg-xsetroot
xorg-xvinfo
xorg-xwayland
xorg-xwd
xorg-xwininfo
xorg-xwud
xorgproto
xtrans
xvidcore
xz
yajl
youtube-dl
yt-dlp
yubico-c
yubico-c-client
yubikey-manager
yubikey-personalization
yubikey-personalization-gui
zathura
zathura-djvu
zathura-pdf-mupdf
zathura-ps
zeromq
zimg
zip
zlib
zsh
zstd
zziplib
